# 1] List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

## 1) read_csv()

In [2]:
df1=pd.read_csv("real_estate_price_size_year_view-Copy1.csv")
df1

         price     size  year         view
0   234314.144   643.09  2015  No sea view
1   228581.528   656.22  2009  No sea view
2   281626.336   487.29  2018     Sea view
3   401255.608  1504.75  2015  No sea view
4   458674.256  1275.46  2009     Sea view
..         ...      ...   ...          ...
95  252460.400   549.80  2009     Sea view
96  310522.592  1037.44  2009  No sea view
97  383635.568  1504.75  2006  No sea view
98  225145.248   648.29  2015  No sea view
99  274922.856   705.29  2006     Sea view

[100 rows x 4 columns]

## 2) head()

In [3]:
df1.head(3)

        price    size  year         view
0  234314.144  643.09  2015  No sea view
1  228581.528  656.22  2009  No sea view
2  281626.336  487.29  2018     Sea view

## 3) tail()

In [4]:
df1.tail(3)

         price     size  year         view
97  383635.568  1504.75  2006  No sea view
98  225145.248   648.29  2015  No sea view
99  274922.856   705.29  2006     Sea view

## 4) describe()

In [5]:
df1.describe()

               price         size         year
count     100.000000   100.000000   100.000000
mean   292289.470160   853.024200  2012.600000
std     77051.727525   297.941951     4.729021
min    154282.128000   479.750000  2006.000000
25%    234280.148000   643.330000  2009.000000
50%    280590.716000   696.405000  2015.000000
75%    335723.696000  1029.322500  2018.000000
max    500681.128000  1842.510000  2018.000000

## 5) value_counts()

In [6]:
df1["view"].value_counts()

No sea view    51
Sea view       49
Name: view, dtype: int64

# 2] Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
dic={"A":[10,20,30],"B":[100,200,300],"C":[1000,2000,3000],}
given_dfQ2=pd.DataFrame(dic)
given_dfQ2

    A    B     C
0  10  100  1000
1  20  200  2000
2  30  300  3000

In [8]:
def re_index(df):
    df=df.reset_index(drop=True)
    df.index=[i for i in range(1,(len(df)*2),2)]
    return df
given_dfQ2=re_index(given_dfQ2)
given_dfQ2

    A    B     C
1  10  100  1000
3  20  200  2000
5  30  300  3000

# 3] You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [9]:
def sum_values(df):
    temp=df.loc[0:2,["values"]]
    print(temp.sum())
dic1={"values":[10,20,30,40,50]}
given_dfQ3=pd.DataFrame(dic1)
sum_values(given_dfQ3)

values    60
dtype: int64

# 4] Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [28]:
def words_count(df):
    df["Word_Count"]=df["Text"].apply(lambda n: len(n.split()))
    return df
dic2={"Text":["how are you?","I'm fine","what's about you?"]}
given_dfQ4=pd.DataFrame(dic2)
given_dfQ4=words_count(given_dfQ4)
given_dfQ4

                Text  Word_Count
0       how are you?           3
1           I'm fine           2
2  what's about you?           3

# 5] How are DataFrame.size() and DataFrame.shape() different?

### => DataFrame.size and DataFrame.shape are both attributes of a pandas DataFrame that provide information about the dimensions of the DataFrame, but they have different meanings.
### 
### => DataFrame.size returns the total number of elements in the DataFrame, which is the product of the number of rows and the number of columns. This includes all elements in the DataFrame, regardless of their values or data types.
### 
### =>DataFrame.shape returns a tuple that represents the dimensions of the DataFrame, in the form of (number of rows, number of columns). This attribute only provides information about the structure of the DataFrame, and does not include any information about the values or data types of the elements

In [11]:
df1.size

400

In [12]:
df1.shape

(100, 4)

# 6] Which function of pandas do we use to read an excel file?

## => read_excel()

# 7] You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column  'Username' in df that contains only the username part of each email address.
# The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [40]:
import re
def get_username(df):
    df['Username'] = df['Email'].str.split('@').str[0]
#     df["Username"] = df["Username"][0]
#     df["Username"]=list(re.findall(('(.*)@', df["Email"]))
    return df
dic3={"Email":["john.doe@example.com","xyz@gamma.com","abc@gija.com"]}
given_dfQ7=pd.DataFrame(dic3)
given_dfQ7=get_username(given_dfQ7)
given_dfQ7
#     print(re.findall('a(.*)b', 'axyzb'))

                  Email  Username
0  john.doe@example.com  john.doe
1         xyz@gamma.com       xyz
2          abc@gija.com       abc

# 8] You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. 
# The function should return a new DataFrame that contains only the selected rows.

In [59]:
dic4={"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]}
given_dfQ8=pd.DataFrame(dic4)

In [60]:
def get_details(df):
    temp=df[(df["A"]>5) & (df["B"]<10)]
    return temp
result=get_details(given_dfQ8)
result

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# 9] Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,  median, and standard deviation of the values in the 'Values' column.

In [58]:
def get_statsfun(df):
    return df["values"].mean(),df["values"].median(),df["values"].std()
x,y,z=get_statsfun(given_dfQ3)
print("mean: ",x)
print("median: ",y)
print("standard daviation: ",z)

mean:  30.0
median:  30.0
standard daviation:  15.811388300841896

# 10] Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [72]:
dic5={"Sales":[5,7,9,12,14,6,18,17,10,13,20,6],"Date":[3,2,4,5,1,6,10,7,9,8,11,12]}
given_dfQ10=pd.DataFrame(dic5)
given_dfQ10

    Sales  Date
0       5     3
1       7     2
2       9     4
3      12     5
4      14     1
5       6     6
6      18    10
7      17     7
8      10     9
9      13     8
10     20    11
11      6    12

In [75]:
def add_moving_average(df):
    df = df.sort_values(by='Date').reset_index(drop=True)
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df
given_dfQ10 = add_moving_average(given_dfQ10)
given_dfQ10

    Sales  Date  MovingAverage
0      14     1      14.000000
1       7     2      10.500000
2       5     3       8.666667
3       9     4       8.750000
4      12     5       9.400000
5       6     6       8.833333
6      17     7      10.000000
7      13     8       9.857143
8      10     9      10.285714
9      18    10      12.142857
10     20    11      13.714286
11      6    12      12.857143

# 11] You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
# The function should return the modified DataFrame.

In [104]:
dic6={"Date":['2023-02-01','2023-01-22','2023-01-03','2023-05-04','2023-01-05']}
given_dfQ11=pd.DataFrame(dic6)
given_dfQ11

         Date
0  2023-02-01
1  2023-01-22
2  2023-01-03
3  2023-05-04
4  2023-01-05

In [105]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df
given_dfQ11=add_weekday_column(given_dfQ11)
given_dfQ11

        Date    Weekday
0 2023-02-01  Wednesday
1 2023-01-22     Sunday
2 2023-01-03    Tuesday
3 2023-05-04   Thursday
4 2023-01-05   Thursday

# 12] Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [84]:
dic7={"Date":['2023-02-01','2023-01-15','2023-01-23','2023-05-01','2023-01-07']}
given_dfQ12=pd.DataFrame(dic7)
given_dfQ12

         Date
0  2023-02-01
1  2023-01-15
2  2023-01-23
3  2023-05-01
4  2023-01-07

In [91]:
def january_days(df):
    df['Date'] = pd.to_datetime(df['Date'])
    temp=df[(df["Date"]>'2023-01-01') & (df["Date"]<'2023-01-31')]
    return temp
result3=january_days(given_dfQ12)
result3

        Date
1 2023-01-15
2 2023-01-23
4 2023-01-07

# 13] To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

### => The first and foremost necessary library that needs to be imported to use the basic functions of pandas is 'pandas' itself. The following code can be used to import pandas:
## import pandas as pd